docs/tmpRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:tns="urn:platform_2017_2.webservices.netsuite.com"
               xmlns:platformMsgs="urn:messages_2017_2.platform.webservices.netsuite.com"
               xmlns:platformFaults="urn:faults_2017_2.platform.webservices.netsuite.com"
               xmlns:platformCore="urn:core_2017_2.platform.webservices.netsuite.com"
               xmlns:platformCommon="urn:common_2017_2.platform.webservices.netsuite.com"
               xmlns:listRel="urn:relationships_2017_2.lists.webservices.netsuite.com"
               xmlns:tranSales="urn:sales_2017_2.transactions.webservices.netsuite.com"
               xmlns:actSched="urn:scheduling_2017_2.activities.webservices.netsuite.com"
               xmlns:setupCustom="urn:customization_2017_2.setup.webservices.netsuite.com"
               xmlns:listAcct="urn:accounting_2017_2.lists.webservices.netsuite.com"
               xmlns:tranBank="urn:bank_2017_2.transactions.webservices.netsuite.com"
               xmlns:tranCust="urn:customers_2017_2.transactions.webservices.netsuite.com"
               xmlns:tranInvt="urn:inventory_2017_2.transactions.webservices.netsuite.com"
               xmlns:listSupport="urn:support_2017_2.lists.webservices.netsuite.com"
               xmlns:tranGeneral="urn:general_2017_2.transactions.webservices.netsuite.com"
               xmlns:listMkt="urn:marketing_2017_2.lists.webservices.netsuite.com"
               xmlns:listWebsite="urn:website_2017_2.lists.webservices.netsuite.com"
               xmlns:fileCabinet="urn:filecabinet_2017_2.documents.webservices.netsuite.com"
               xmlns:listEmp="urn:employees_2017_2.lists.webservices.netsuite.com">
  <soap:Header>
    <platformMsgs:passport>
      <platformCore:email>alexandr@buildateam.io</platformCore:email>
      <platformCore:password>PPP3001117</platformCore:password>
      <platformCore:account>3946319</platformCore:account>
      <platformCore:role internalId="3"></platformCore:role>
    </platformMsgs:passport>
    <platformMsgs:applicationInfo>
      <platformCore:applicationId>7BCC32F1-FBA5-4796-A6C4-D443AEBCD47C</platformCore:applicationId>
    </platformMsgs:applicationInfo>
  </soap:Header>
  <soap:Body>
    <platformMsgs:add xmlns:platformMsgs="urn:messages_2017_2.platform.webservices.netsuite.com"
                      xmlns="urn:messages_2017_2.platform.webservices.netsuite.com">
      <platformMsgs:Customer xsi:type="relShipCustomer:Customer"
                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                             xmlns:relShipCustomer="urn:relationships_2017_2.lists.webservices.netsuite.com">
        <relShipCustomer:addressbookList
          xsi:type="relShipCustomerAddressbookList:CustomerAddressbookList"
          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
          xmlns:relShipCustomerAddressbookList="urn:relationships_2017_2.lists.webservices.netsuite.com"
          replaceAll="true">
          <relShipCustomerAddressbookList:addressbook
            xsi:type="relShipCustomerAddressbook:CustomerAddressbook"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:relShipCustomerAddressbook="urn:relationships_2017_2.lists.webservices.netsuite.com">
            <relShipCustomerAddressbook:addressbookAddress xsi:type="platformCommonAddress:Address"
                                                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                                           xmlns:platformCommonAddress="urn:common_2017_2.platform.webservices.netsuite.com">
              <platformCommonAddress:addr1>addr1</platformCommonAddress:addr1>
              <platformCommonAddress:addr2>addr2</platformCommonAddress:addr2>
              <platformCommonAddress:addr3>addr3</platformCommonAddress:addr3>
              <platformCommonAddress:addressee>addressee</platformCommonAddress:addressee>
              <platformCommonAddress:addrPhone>addrPhone</platformCommonAddress:addrPhone>
              <platformCommonAddress:addrText>addrText</platformCommonAddress:addrText>
              <platformCommonAddress:attention>attention</platformCommonAddress:attention>
              <platformCommonAddress:city>city</platformCommonAddress:city>
              <platformCommonAddress:country>_unitedStates</platformCommonAddress:country>
              <platformCommonAddress:override>false</platformCommonAddress:override>
              <platformCommonAddress:state>state</platformCommonAddress:state>
              <platformCommonAddress:zip>000000</platformCommonAddress:zip>
            </relShipCustomerAddressbook:addressbookAddress>
            <relShipCustomerAddressbook:defaultBilling>true
            </relShipCustomerAddressbook:defaultBilling>
            <relShipCustomerAddressbook:defaultShipping>true
            </relShipCustomerAddressbook:defaultShipping>
            <relShipCustomerAddressbook:isResidential>false
            </relShipCustomerAddressbook:isResidential>
            <relShipCustomerAddressbook:label>label</relShipCustomerAddressbook:label>
          </relShipCustomerAddressbookList:addressbook>
          <relShipCustomerAddressbookList:addressbook
            xsi:type="relShipCustomerAddressbook:CustomerAddressbook"
            xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
            xmlns:relShipCustomerAddressbook="urn:relationships_2017_2.lists.webservices.netsuite.com">
            <relShipCustomerAddressbook:addressbookAddress xsi:type="platformCommonAddress:Address"
                                                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                                                           xmlns:platformCommonAddress="urn:common_2017_2.platform.webservices.netsuite.com">
              <platformCommonAddress:addr1>addr1</platformCommonAddress:addr1>
              <platformCommonAddress:addr2>addr2</platformCommonAddress:addr2>
              <platformCommonAddress:addr3>addr3</platformCommonAddress:addr3>
              <platformCommonAddress:addressee>addressee</platformCommonAddress:addressee>
              <platformCommonAddress:addrPhone>addrPhone</platformCommonAddress:addrPhone>
              <platformCommonAddress:addrText>addrText</platformCommonAddress:addrText>
              <platformCommonAddress:attention>attention</platformCommonAddress:attention>
              <platformCommonAddress:city>city</platformCommonAddress:city>
              <platformCommonAddress:country>_unitedStates</platformCommonAddress:country>
              <platformCommonAddress:override>false</platformCommonAddress:override>
              <platformCommonAddress:state>state</platformCommonAddress:state>
              <platformCommonAddress:zip>000000</platformCommonAddress:zip>
            </relShipCustomerAddressbook:addressbookAddress>
            <relShipCustomerAddressbook:defaultBilling>true
            </relShipCustomerAddressbook:defaultBilling>
            <relShipCustomerAddressbook:defaultShipping>true
            </relShipCustomerAddressbook:defaultShipping>
            <relShipCustomerAddressbook:isResidential>false
            </relShipCustomerAddressbook:isResidential>
            <relShipCustomerAddressbook:label>label</relShipCustomerAddressbook:label>
          </relShipCustomerAddressbookList:addressbook>
        </relShipCustomer:addressbookList>
        <relShipCustomer:firstName>firstName</relShipCustomer:firstName>
        <relShipCustomer:lastName>lastName</relShipCustomer:lastName>
        <relShipCustomer:phone>123456789</relShipCustomer:phone>
        <relShipCustomer:email>joe.doe@abc.com</relShipCustomer:email>
      </platformMsgs:Customer>
    </platformMsgs:add>
  </soap:Body>
</soap:Envelope>
